tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# libs
## compression
brew "brotli"
brew "bzip2"
brew "libzip"
brew "lz4"
brew "xz"
brew "zlib"
brew "zstd"

## other
brew "curl"
brew "fzf"
brew "icu4c"
brew "ncurses"
brew "openssl@3"
brew "pcre2"
brew "readline"
brew "ripgrep"
brew "sqlite"

# tools
## lang
brew "go"
brew "llvm"
brew "pyenv"
brew "rust"

## main
brew "autossh"
brew "git"
brew "starship"
brew "tmux"
brew "zsh"

## helpers
brew "awscli"
brew "direnv"
brew "gh"
brew "git-lfs"
brew "httpie"
brew "nmap"
brew "rsync"
brew "semgrep"
brew "sslscan"
brew "terraform"
brew "tldr"
brew "tree"
brew "watch"
brew "wget"
brew "yt-dlp"

cask "docker"
cask "hex-fiend"
cask "keka"
cask "obsidian"
cask "sublime-merge"
cask "sublime-text"
cask "tailscale"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
