# libs
## compression
brew "brotli"
brew "bzip2"
brew "libzip"
brew "lz4"
brew "xz"
brew "zlib"
brew "zstd"

## other
brew "curl"
brew "fzf"
brew "icu4c"
brew "ncurses"
brew "openssl"
brew "pcre2"
brew "readline"
brew "ripgrep"
brew "sqlite"

# tools
## lang
brew "go"
brew "llvm"
brew "ninja"
brew "rust"
brew "uv"

## main
brew "git"
brew "starship"
brew "tmux"
brew "zsh"

## helpers
brew "direnv"
brew "git-lfs"
brew "rsync"
brew "tlrc"
brew "tree"
brew "watch"
brew "wget"
