eamodio.gitlens
foxundermoon.shell-format
GitHub.remotehub
ms-azuretools.vscode-docker
ms-python.gather
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-edit-nightly
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.hexeditor
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
redhat.fabric8-analytics
redhat.vscode-commons
ryanluker.vscode-coverage-gutters
Semgrep.semgrep
TheaFlowers.witch-hazel
VisualStudioExptTeam.vscodeintellicode
